Revit 2026 API
WireMaterialTypeSet.Erase Method
Removes a specified wire material type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual int Erase(
	WireMaterialType item
)
Public Overridable Function Erase (
	item As WireMaterialType
) As Integer
public:
virtual int Erase(
	WireMaterialType^ item
)
abstract Erase :
        item : WireMaterialType -> int
override Erase :
        item : WireMaterialType -> int
Parameters
item WireMaterialType
The wire material type to be erased.
Return Value
Int32
The number of wire material types that were erased from the set.
See Also
Reference
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace